---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ZOffsetValue
source: html/a94af141-0f3c-7285-33c5-19b6df5ef1b0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ZOffsetValue Property

"z Offset Value"

## Syntax (C#)
```csharp
public static ForgeTypeId ZOffsetValue { get; }
```